+
-
able
above
abruptly
absolute
absolutely
abt
acceptable
access
accidentally
account
across
action
activate
activated
actual
actually
add
added
adding
address
adjust
admit
adobe
advice
affordable
aftr
again
ago
ahead
ak
alert
alias
allow
almost
alone
along
alot
already
although
always
amazed
amazing
amb
amber
among
amount
amp
andriod
android
androids
angles
angry
annoying
another
answer
answering
anybody
anymore
anyone
anything
anyway
apart
app
apparently
appear
appeared
application
applications
appreciate
approached
apps
april
area
around
arrived
ask
asked
aspect
aspects
asphalt
astard
atk
atleast
attach
attache
attaching
attend
attention
attractive
audio
august
authorised
auto
automatic
automatically
available
average
avoid
away
awesome
awesomeness
awsome
awsoo
b
background
backup
bad
badly
bang
bangalore
bar
bargain
based
basic
battery
battry
beat
beats
beautiful
beauty
became
become
becomes
been
before
beginning
behaving
being
believe
below
best
bet
better
between
beyond
big
bigger
bike
bing
birds
bit
black
blah
blank
blowing
bluetooth
board
body
book
booked
boot
booting
boring
both
bother
bottom
bought
box
bracket
brand
break
breeze
bright
brightness
brilliant
broke
broked
broken
brother
brought
browse
browser
browsing
bt
bucks
budget
buggy
bugs
build
built
bulk
business
busted
button
buttons
buy
buyer
buyers
buying
call
called
caller
calling
calls
cam
came
camera
cameras
cannot
canot
cant
canvas
capabilities
capable
captured
card
card-
cards
care
careful
carl
case
catching
category
cause
cell
cellphone
center
centers
centre
certainly
change
changed
changes
changing
charge
charges
charging
charm
chat
cheap
cheaper
cheapest
cheated
check
checked
choice
choose
city
clarity
class
classy
clean
clear
clearblack
click
clicking
close
closed
closing
clue
colleagues
collection
color
colour
combination
comes
comfortable
coming
comment
common
company
compare
compared
comparing
comparison
compatible
competition
competitive
complain
complained
complaint
complaints
complete
completely
completly
complicated
con
concern
concerned
conclusion
condition
conditions
configuration
confusion
connected
connection
connectivity
cons
cons:
constant
consumer
contact
contacts
contains
continue
continues
continuous
contrast
control
cool
coolest
copy
core
corner
corning
cost
costly
costs
costsk
couldnot
country
couple
cover
covered
cracked
cracks
crap
crash
crashes
creating
credibility
crisp
cry
current
curved
customer
customers
customization
cyan
d
daily
damage
damn
dark
data
date
daughter
days
dead
deal
dealing
dec
december
decent
decided
decision
decrease
dedicated
default
defective
defects
defiantly
definitely
delicate
delivered
delivery
density
design
designed
desktops
despite
details
dev
developer
developing
device
devices
did
didn
didnot
didnt
differ
difference
different
difficult
digital
digitizer
dint
directly
disadvantages
disappointed
disappointment
disappoints
disconnects
display
displaying
dissatisfied
document
does
doesnot
doesnt
doing
don't
done
donot
dont
doubt
down
download
downloaded
drain
drawback
draws
drive
drop
dropped
due
dull
dumb
durability
during
e
e-
each
eager
ear
earlier
earned
earphone
easily
easy
edge
edit
editing
effect
effective
either
elegant
else
email
end
english
enjoy
enjoying
enough
enter
entertain
entertaining
entire
ergonomically
error
errors
especially
etc
eventhough
ever
every
everybody
everyday
everyone
everything
evn
evry
exactly
example
excel
excellent
except
exchange
excited
exciting
exist
expect
expectations
expected
expecting
experience
experienced
expiry
explore
exploring
extended
extension
extensive
external
extra
extremely
eye
eyes
fabulous
face
facebook
faced
facility
facing
fact
factor
factory
fading
failed
fall
falling
famous
fan
fantastic
far
fast
faster
father
faulty
fb
feature
features
feel
feeling
feels
feet
fell
felt
few
fifteen
file
files
filled
finally
find
finding
fine
fits
five
fix
fixed
fixing
flash
flaws
flip
flipkart
flippyis
floor
fluid
fluidic
focus
follow
following
fone
font
fool
forced
forget
fork
form
format
formats
forum
forums
found
fragile
frankly
frds
freak
free
freeze
freezes
freezing
frequent
frequently
friend
friendly
friends
front
frozen
frustrated
full
fully
fun
function
functionality
functioning
functions
funny
future
g
gadget
galaxy
game
gamer
gamers
games
gaming
gave
gb
genuine
gets
getting
giant
gift
gifted
given
gives
giving
glad
glam
glance
glass
glossy
gmail
god
goes
going
gone
gonna
good
goods
google
gorilla
got
grab
grand
graphics
great
group
guarantee
guard
gud
guess
gui
guys
had
half
hand
handle
handled
hands
handset
handsets
handy
hang
hanged
hanging
hangs
happen
happened
happens
happily
happy
hard
hardcore
hardly
hardware
has
hate
hav
havent
having
hd
head
headphone
headset
hear
heard
heart
heat
heated
heating
heats
heavily
heavy
height
hell
help
helpful
hence
here
hey
hi
high
higher
highly
hindi
hit
hold
holding
home
honest
hope
hopeless
horrible
hotmail
hour
hours
however
hrs
htc
huge
hung
iam
ie
ignore
ihave
im
image
images
important
impressed
impression
impressive
inbuilt
inch
incoming
increase
increased
increasing
information
initially
ink
inr
inside
install
installed
instances
instantly
instead
interested
interface
internal
internet
intuitive
investment
ios
iphone
iphones
irritated
irritating
isgb
isk
isnot
issue
issues
item
itis
itself
itwill
it’s
iwill
jack
job
july
june
juss
k
keep
keeps
kept
key
keyboard
keys
kid
kind
know
known
kolkata
l
lack
lacks
lag
lagging
lags
large
last
lasted
lastly
lasts
late
later
latest
launch
launched
lcd
least
left
lenovoa700
lens
less
let
lets
letting
level
lg
life
light
like
liked
likes
limitation
limitations
limited
line
list
little
live
ll
local
location
lock
logo
long
looked
looking
looks
lost
lot
lots
loudspeaker
love
loved
lovely
lover
loving
low
lower
lowlight
loyal
lumia
lumia720
lumiais
lumias
m
made
mail
main
major
make
makes
making
manage
manager
manufacturing
many
map
maps
mark
market
marketplace
masterpiece
matter
max
may
mb
mean
means
media
megapixel
memory
memorygb
mention
menu
message
messages
messaging
mic
micro
micromax
microphone
microsd
microsoft
mid
middle
might
mind
mindblowing
mine
mins
minus
minutes
minuts
miss
missed
missing
mistake
mobile
mobiles
mode
model
models
moderate
moment
money
month
months
more
moreover
morning
mostly
mother
motherboard
motion
moto
move
moved
moving
mp
ms
msg
much
multi
multiple
music
must
myself
myst
myth
n
name
navigation
nd
near
nearly
necessary
need
needed
needs
negative
neither
net
network
never
new
next
nexus
nice
nicely
night
nl
nl620
no
noise
noisy
nokia
nokiais
non
none
nor
normal
not
notch
note
nothing
notice
noticed
notification
notifications
number
obviously
occur
october
off
offer
offering
office
offline
ofk
ofmb
often
ok
old
older
olx
once
ones
ong
online
onlygb
open
opening
opens
operate
operating
operation
opinion
opted
optics
option
options
order
ordered
original
orignl
os
others
otherwise
othr
outlook
outside
outstanding
overall
own
owner
package
packaging
pad
page
paid
pain
painful
part
particular
parts
party
past
paste
pastmonths
pathetic
patience
pattern
pay
pc
pdf
penny
people
per
perfect
perfectly
perform
performance
performs
period
persists
person
personal
personally
ph
phone
phone-
phone;
phoneis
phones
phonne
photo
photography
photos
physical
pic
pics
picture
pictures
piece
pixels
place
planning
platform
play
played
player
playing
plays
please
pleasure
plenty
pls
plus
pocket
point
points
policy
poor
popular
positive
possible
post
potential
power
powerful
ppi
prblm
prefer
premium
present
press
pressing
pretty
previous
previously
price
priced
prices
primary
priority
probably
problem
problematic
problems
process
processing
processor
product
production
products
professional
promised
proof
proper
properly
proposition
pros
pros:
proud
provide
provided
providing
pull
purchase
purchased
purchasing
purpose
purposes
put
quality
quick
quite
r
raised
ram
range
rate
rather
rating
re-boots
reach
read
readability
reader
reading
ready
real
reality
realize
really
rear
reason
reasonable
reasons
reboot
reboots
receive
received
recent
recently
recieved
recommend
recommendation
recommended
recommending
recording
red
refined
refreshing
refreshingly
regarding
regret
regreting
regular
release
released
reliable
relief
remains
removable
remove
repair
repaired
repeated
replace
replaced
replacement
replacing
replcemnt
reply
report
request
required
reset
resetting
resolution
resolve
respect
respond
responding
response
responsive
rest
restart
restarting
restarts
restricted
retail
retailer
return
returned
review
reviews
rich
right
ring
ringing
rings
ringtone
risk
robust
rock
rocker
rocks
roll
route
rs
rs7500
run
running
s2
s3
sad
said
sale
same
samsung
satisfaction
satisfied
satisfy
save
saver
saw
saying
says
scratch
scratches
screen
sd
search
second
secondly
seconds
secs
section
seeing
seem
seems
seen
segment
selection
self
sell
seller
selling
send
sending
sense
sensitive
sensitivity
sensor
separately
series
serious
seriously
server
service
services
servicing
set
setting
settings
several
sexy
share
shared
ship
shipping
shit
shock
shop
shops
should
show
showed
showing
shows
shut
side
sight
signal
sim
similar
simple
simpler
simplicity
simply
since
single
site
situation
size
skype
sleek
slick
slim
slipped
slow
slowdown
small
smaller
smart
smartphone
smartphones
smooth
smoothly
sms
social
soft
software
softwares
sold
solid
solution
solve
someone
something
sometime
sometimes
song
songs
sony
soon
sorts
sound
sounds
space
spares
speaker
spec
specially
specific
specifically
specifications
specs
spectacular
speed
spend
spent
spite
spoiled
spots
stable
stand
stands
star
stars
start
started
starts
stay
still
stock
stop
stopped
stops
storage
store
stored
stores
strength
strong
strongly
stuck
student
stuff
stunning
stunningly
stupid
sturdy
style
stylish
subscription
success
such
sucking
sucks
sudden
suddenly
suggest
suggested
suggestion
suite
suits
sunlight
super
superb
superior
support
supported
supports
sure
surfing
surprise
surprised
switch
switched
switches
switching
symbian
sync
system
systems
taake
tag
take
taken
takes
talking
tasking
tasks
tech
technical
technology
tell
temple
terms
terrible
terribly
test
text
texts
thank
thanks
thatis
thats
themp
thereby
therez
thing
things
thinking
thinks
third
thng
thoroughly
those
though
thought
three
thrice
through
tile
tiles
till
time
times
today
together
told
tomorrow
tones
too
took
tools
top
total
totally
touch
touchscreen
tough
transfer
transitions
treat
tried
trouble
true
truly
trust
truth
try
trying
tuk
turn
turned
turning
turns
twice
type
typing
u
uc
ugly
ui
unable
unbelievable
uncomfortable
under
underk
understand
unexpectedly
unfortunately
unfriendly
unhappy
uni
unibody
unless
unlike
unlock
unluckily
until
untill
update
updated
updates
updating
upload
uploaded
upon
ups
upto
ur
usage
used
useful
useless
user
users
uses
using
usual
usually
utter
uwill
valid
value
variety
various
version
versions
very
via
vibrant
vibrates
vibrating
vibration
video
videos
view
viewing
visit
visited
voice
void
vol
volume
vs
wait
waiting
wanna
wanted
wants
warranty
warrenty
wastage
waste
wasted
wat
weak
web
website
week
weeks
weight
weighted
went
were
whatever
whatis
whats
whatsapp
whenever
where
whether
while
white
whole
why
wi-fi
wider
wife
wifi
win
window
windowis
windows
wise
wish
within
withink
without
withstands
witnessed
wonder
wonderful
wont
word
words
worked
working
works
world
worry
worrying
worse
worst
worth
worthwhile
worthy
wp
wp8
writing
wrked
wrong
ws
wud
xperia
y
yar
years
yes
yesterday
yet
youare
yourself
youtube
youwill
zack
zeiss
zesis
zoom
